Term3/algo/hws/HW_13_2.tex
% Created 2020-11-04 Wed 14:13
% Intended LaTeX compiler: pdflatex
\documentclass{article}
       \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[russian, english]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{tikz}
\usepackage{capt-of}
       
       \usepackage{geometry}
       \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Задание 13.2}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Задание 13.2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
Найти общий префикс максимальной длины подстрок \(s[i : n]\) и \(s[j : n]\) \\

Из первого задания знаем, что можем находить \(hash(s[i:j])\) за \(O(1)\). \\
Так как функция \(y(l) = hash(s[i : i + l]) == hash(s[j : j + l])\) убывает и
начиная с какого-то места будет равна \(0\), то будем искать
максимальную длину префикса \(l\) бин. поиском

\begin{minted}[frame=lines,linenos=true,mathescape]{python}
l = 0
r = n - max(i, j)

while r - l > 1:
    m = (l + r) / 2
    if hash(s[i : i + m]) == hash(s[j : j + m]):
	l = m
    else:
	r = m
\end{minted}

Время работы бин. поиска \(O(\log{n})\)
\end{document}
